{
    "hindiMovies": [
        {
            "id": "adhm",
            "title": "Aye Dil Hain Muskil",
            "releaseYear": 2016,
            "cast": [
                "Ranbir Kapoor",
                "Anushka Sharma",
                "Aishwarya RAI"
            ],
            "director": "Karan Johar",
            "ratings": 5.8,
            "details": "Alizeh, an independent woman recovering from a breakup, and Ayan, a naive musician, meet in New York and form an incredible bond. From there, they experience love, heartbreak and the facts of life.",
            "reviews": {
                "title": "Weak script ruins everything!",
                "description": "The theme of unrequited love is interesting and from someone like Karan johar, it was expected much more! The movie has moments, typical of a Karan johar movie and it delights you, coupled with great music and Ranbir Kapoor's strong performance but those moments are very few and they get diluted in an otherwise collection of scenes that felt like was written to please the younger generation.The major problem is the story, the Anushka and Ranbir's conflict is stretched too much and the final resolution is very underwhelming and a cliche. Also, the characters are one tone throughout the movie and by the end, you don't care about them in any way. The final nail on the coffin is Anushka's cancer, like seriously, its the most cliche plot point of Bollywood and has been used more than anything else, expected something better than this in 2016.The movie was just badly written and could have been made a lot better if the story was a bit more thought out. Watch it only for some good emotional scenes, awesome music, and Ranbir Kapoor's performance but despite all of these, its really tough to like this film."
            }
        },
        {
            "id": "tamasha",
            "title": "Tamasha",
            "releaseYear": 2015,
            "cast": [
                "Ranbir Kapoor",
                "Deepika Padukon"
            ],
            "director": "Imtiaz Ali",
            "ratings": 7.3,
            "details": "A boy meets a girl, in Corsica. They decide not to reveal their real name or personality.",
            "reviews": {
                "title": "Awesome movie...will be loved by those who don't love Bollywood typical movie",
                "description": "Superb direction, superb movie, superb acting and yes Imtiaz Ali did it again. Not a Romeo Juliet movie like love, separating and then happy ending. It is different from routine love stories. A powerful message of an ordinary human with a powerful expression of unorthodox. Coming to cinematography beautiful scenic locations with awesome camera work.Literally an unconventional experiment to be watched for its writing & making !!! Second half goes for Ranbir and Deepika is cute as always.\nAt last these types of movies regain faith about Bollywood. We can also do it Hats off >>>>>> Amazed"
            }
        },
        {
            "id": "yjhd",
            "title": "Yeh Jawaani Hai Deewani",
            "releaseYear": 2013,
            "cast": [
                "Ranbir Kapoor",
                "Deepika Padukon",
                "Aditya Roy Kapoor"
            ],
            "director": "Ayan Mukerji",
            "ratings": 7.2,
            "details": "Kabir and Naina bond during a trekking trip. Before Naina can express herself, Kabir leaves India to pursue his career. They meet again years later, but he still cherishes his dreams more than bonds.",
            "reviews": {
                "title": "Yeh Jawaani is full of Deewani!",
                "description": "Yeh Jawaani hai Deewani is a refreshing take on the lives of the youth(of varied types)-their needs,their aspirations,their madness. Inspite of being 3+ hours,it never felt like a long film. It is a movie with a lot of flair,adventure and madness, as you would expect from the title.\n The acting cast is mouth-watering. Ranbir Kapoor as Bunny is brilliant. He plays a character who loves to have all the fun, wants to live life at a fast pace and has this quirky ambition of visiting all the beautiful places in the world. Good job Ranbir, great acting skills and mind-blowing dancing skills that is always fun viewing. Deepike Padukone as Naina shines as an actor and shows she is more than just good looks with a beautiful rendition of a nerdy girl who is looking to break all inhibitions. I think she captured a studious,unsatisfied and conflicted girl perfectly. Kalki as Aditi exceeded my expectations. It was a treat watching Aditya Roy Kapoor who always lit up the screen whenever he was present."
            }
        },
        {
            "id": "ddlj",
            "title": "Dilwale Dulhania Le Jayenge",
            "releaseYear": 1995,
            "cast": [
                "Shah Rukh Khan",
                "Kajol",
                "Amrish Puri"
            ],
            "director": "Aditya Chopra",
            "ratings": 8,
            "details": "When Raj meets Simran in Europe, it isn't love at first sight but when Simran moves to India for an arranged marriage, love makes its presence felt.",
            "reviews": {
                "title": "Dilwale Dulhania Le Jayenge: A Commentary",
                "description": "This was the top Bollywood film of the 90s and after seeing it I really can't think of one that was better. There are some that are just as good but I can't recall seeing one that's better. The story's pretty routine: boy meets girl in Europe, they fall in love, girl is engaged to some other idiot, and the rest writes itself... Sound familiar? Well it wasn't back in '95 (or even if it was it wasn't done as well) and Aditya Chopra's treatment of the story was a big reason for it's success. In every other movie the couple first wants to kill each other before falling in love. But in this movie it's slightly different and more plausible. Shahrukh doesn't want to kill Kahol - I mean Kajol - and she doesn't really hate him either, she just (like the rest of us) is annoyed by the guy. Their situations aren't that far-fetched and their Europe storyline is played out quite realistically (of course the piano scene is an exception). This was the beginning of the 'Shahrukh plays Shahrukh era' and, for what it's worth, he hasn't made a better movie or given a better performance since. Sure there are places where he overacts but there are just as many places where he's able to hit all his cues. His comic timing was never better and there was still some sincerity in his eyes, a reminder of the fact that he was still an actor, which has since been replaced by the cockiness of a megastar. This is the movie that shot him to superstardom and put him alongside Aamir and Salman. Kajol is just as good (if not better), and I think after their next movie they'll win the Nobel Prize for Chemistry. The supporting cast is fine although no one really stands out. There are many moments in the film, most notably in the script, where you might feel a sense of deja vu. But keep in mind that this was the original, it's everything else that's a rehash. Bollywood headed straight for the sewer after this movie with almost all films, many of them starring Shahrukh, copying the same formula. Even at its 3 hour length the movie never drags till after the two-hour mark. I also want to comment on the film's Art Direction because it warrants a mention. Whether it's in Europe, England, or India, the movie has a very natural look to it. Unlike today's big films like Dil To Pagal Hai, or K3G, this movie looks good without trying to look good and I think that's a quality that's been lost on today's films. Too much attention is spent on the look at the expense of the story (if there is one!). The soundtrack of course is a classic, truly one of the all-time bests, with almost every song being a hit. The film won an unprecedented number of awards while breaking many records. There was a feeling that Aditya would follow in his father Yash's footsteps but regrettably the pressure got to him. He followed this up with the dreadful Mohabbatein which was slammed by audiences and critics alike. But so what. His first film was good, and with the current state of Bollywood movies - Devdas anyone? - you really can't get better than this."
            }
        }
    ]
}